[
  {
    "image": "public/bikewatching.png",
    "title": "Bikewatching",
    "role": "-",
    "period": "2025",
    "description": "Developing geospatial visualizations",
    "tools": ["Mapbox-gl", "D3", "Javascript"],
    "url": "https://nabilafifahq.github.io/bikewatching/"
  },
  {
    "image": "",
    "title": "Marketing Communications at UC San Diego IT Services",
    "role": "Marketing Communications Specialist",
    "period": "2025",
    "description": "Developing and executing comprehensive communication strategies for IT Services, including weekly internal newsletters and the Process Palooza website. Managing content creation, web updates, and promotional materials across digital and print platforms while ensuring brand consistency and accessibility compliance.",
    "tools": ["Emma", "Jira", "Notion", "CMS", "Canva", "Adobe Creative Suite"],
    "url": ""
  },
  {
    "image": "",
    "title": "Community Growth at Tech Voice Indonesia",
    "role": "Community Specialist",
    "period": "2025",
    "description": "Leading community engagement initiatives for a tech community of 1,600+ members. Conducted market research to identify pain points and designed product offerings including AI courses, career prep workshops, and language programs. Developed quarterly roadmaps for events and created marketing collateral to drive member engagement and satisfaction.",
    "tools": ["WhatsApp", "Google Forms", "Sheets", "Canva", "Trello", "Typeform"],
    "url": ""
  },
  {
    "image": "",
    "title": "Business Development for MSMEs",
    "role": "Business Development Specialist",
    "period": "2025",
    "description": "Conducted comprehensive market research to uncover growth opportunities in the MSME sector. Led outreach campaigns and delivered persuasive presentations to potential clients. Worked on projects including a Point of Sales Dashboard for CV Pandumedia Mulya Sejahtera and Web E-commerce platform for CV Gas Pol Indonesia.",
    "tools": ["LinkedIn", "Gmail", "Canva", "Airtable", "Calendly"],
    "url": ""
  },
  {
    "image": "",
    "title": "Campaign Management at Perempuan Masa Depan ID",
    "role": "Project Manager & Outreach",
    "period": "2024",
    "description": "Managed end-to-end execution of webinars and national campaigns celebrating Women's Day and Indonesian holidays. Led outreach to speakers and sponsors, developed creative kits for Instagram campaigns, and analyzed event performance through KPI reports to improve future outcomes.",
    "deliverables": ["Instagram live series", "webinar programs", "career coaching", "fundraising initiatives"],
    "url": ""
  },
  {
    "image": "",
    "title": "Edtech Business Strategy for Telkom Indonesia",
    "role": "Business Development Program Participant",
    "period": "2024",
    "description": "Led business model development for Pijar Mahir, a digital upskilling platform. Created Lean Canvas, pitch decks, and strategic recommendations. Researched partnership opportunities with government agencies and developed pricing strategies to enhance revenue optimization in the competitive edtech landscape.",
    "tools": ["Figma", "Lucidchart", "SEMrush", "Canva"],
    "url": ""
  },
  {
    "image": "",
    "title": "Tourism & Digital Marketing with AIESEC",
    "role": "Local Volunteer",
    "period": "2024",
    "description": "Conducted research on local tourism trends in Malang, identifying promotion opportunities for destinations like Bedengan Camping Ground and Kampung Warna Warni Jodipan. Led multimedia campaign creation for Dona Doni Rattan Gallery, enhancing their digital marketing presence through videos and strategic content.",
    "tools": ["Canva", "CapCut", "SurveyMonkey", "Social Media Platforms"],
    "url": ""
  },
  {
    "image": "",
    "title": "Startup Incubation at Bangkit Academy",
    "role": "Product Marketing Lead",
    "period": "2023",
    "description": "Collaborated with cross-functional teams to design go-to-market strategies for a mobile-based mental health platform. Conducted user testing, developed product positioning, and coordinated promotional campaigns across multiple channels.",
    "tools": ["Figma", "Google Analytics", "Notion", "Slack"],
    "url": ""
  },
  {
    "image": "",
    "title": "CSR and Social Impact Program",
    "role": "Program Coordinator",
    "period": "2022",
    "description": "Coordinated social responsibility initiatives focusing on education and women empowerment. Partnered with NGOs to launch campaigns that provided scholarships and entrepreneurship training for local communities.",
    "tools": ["Google Workspace", "Mailchimp", "Trello"],
    "url": ""
  },
  {
    "image": "",
    "title": "Content Development for Youth Empowerment Portal",
    "role": "Content Strategist",
    "period": "2021",
    "description": "Planned and wrote content for a youth empowerment platform focusing on personal growth, digital literacy, and entrepreneurship. Designed social media calendars and optimized SEO for blog content.",
    "tools": ["WordPress", "Google Docs", "Canva", "Hootsuite"],
    "url": ""
  },
  {
    "image": "",
    "title": "Research and Innovation Fair",
    "role": "Event Organizer",
    "period": "2020",
    "description": "Managed logistics, promotion, and participant engagement for the annual UGM innovation exhibition. Designed digital brochures and improved event visibility through social media campaigns.",
    "tools": ["Google Sheets", "Canva", "Instagram", "Mailchimp"],
    "url": ""
  },
  {
    "image": "",
    "title": "Creative Design Intern at Local Startup",
    "role": "Design Intern",
    "period": "2019",
    "description": "Supported the creative team in producing digital and print design materials for brand campaigns. Assisted in logo design, promotional videos, and social media templates for client projects.",
    "tools": ["Adobe Illustrator", "Premiere Pro", "Canva"],
    "url": ""
  },
  {
    "image": "",
    "title": "Campus Magazine Editor",
    "role": "Editor-in-Chief",
    "period": "2018",
    "description": "Led a team of student writers and designers to publish a quarterly campus magazine. Oversaw content curation, layout design, and distribution both online and offline.",
    "deliverables": ["quarterly magazine issues", "feature articles", "interviews", "editorials"],
    "url": ""
  },
  {
    "image": "",
    "title": "Volunteer for Local Literacy Movement",
    "role": "Community Volunteer",
    "period": "2018",
    "description": "Organized reading sessions for underprivileged children and managed book donation campaigns. Created storytelling events to promote literacy awareness.",
    "tools": ["Google Docs", "Canva", "Facebook Pages"],
    "url": ""
  },
  {
    "image": "",
    "title": "Event Promotion for Student Entrepreneurship Fair",
    "role": "Marketing Assistant",
    "period": "2017",
    "description": "Supported the marketing team in promoting student entrepreneurship exhibitions through posters, flyers, and online campaigns. Assisted in sponsor outreach and booth coordination.",
    "tools": ["CorelDRAW", "Instagram", "Email Marketing Tools"],
    "url": ""
  },
  {
    "image": "",
    "title": "Public Relations for Campus Debate Club",
    "role": "PR Coordinator",
    "period": "2017",
    "description": "Handled media relations, managed club announcements, and coordinated debate event promotions. Increased member participation through effective storytelling and outreach.",
    "deliverables": ["press releases", "poster designs", "event promotions"],
    "url": ""
  }
]
